eisup_2019_docmng_integration/src/Documents/абс_ШаблонНовогоДокумента/абс_ШаблонНовогоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ШаблонНовогоДокумента</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/абс_ШаблонНовогоДокумента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Перем мТекущийПользователь;

&НаСервере
Перем мРолиПользователя;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
Процедура УстановитьДоступностьПоСтатусу()
	
	Если Объект.Статус <> Перечисления.абс_СвоеПеречисление.Подготовка Тогда
		ТолькоПросмотр = Истина;
		
	Иначе	
		ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Статус.ТолькоПросмотр = Ложь;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов() Экспорт	
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	
	Список = Элементы.Статус.СписокВыбора;
	Список.Очистить();
	
	Список.Добавить(Объект.Статус);
	ТекСтатус = Объект.Ссылка.Статус;
	
	Если ТекСтатус = Перечисления.абс_СвоеПеречисление.Подготовка Тогда	
		//Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отмена);
	//ИначеЕсли	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция СпрашиватьПричинуИзмененияСтатуса()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СпрашиватьПричину = НЕ Объект.Статус = Объект.Ссылка.Статус;
	
	Возврат СпрашиватьПричину;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Сначало надо записать документ.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);
	ОткрытьФорму("Справочник.ХранилищеДополнительнойИнформации.Форма.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовФормы()
	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Элементы.Статус.СписокВыбора.НайтиПоЗначению(мСтатус) = Неопределено Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Выбран неверный статус документа");
		
		мСтатус = Объект.Статус;
		
		Возврат;
	КонецЕсли;
	
	Объект.Статус = мСтатус;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь"); 
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Элементы.Статус.ТолькоПросмотр = Истина;
		Объект.ПричинаИзмененияСтатуса = "";
		Объект.Статус = Перечисления.абс_СвоеПеречисление.Подготовка;

		Объект.Организация			= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(мТекущийПользователь, "ОсновнаяОрганизация");
		
	КонецЕсли;	
	
	ЗаполнитьСписокДоступныхСтатусов();
	//УстановитьОтборИзмененияСтатусов();
	мСтатус = Объект.Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементовФормы();
	УстановитьДоступностьПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ПричинаИзмененияСтатуса = "";
	Если СпрашиватьПричинуИзмененияСтатуса() Тогда
		ВвестиСтроку(Объект.ПричинаИзмененияСтатуса, "Введите причину изменения статуса",,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусу();
	ЗаполнитьСписокДоступныхСтатусов();
	
КонецПроцедуры
